-- Font.lua

local Font = {}

Font.glyphs = {
	["\1"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"## ##",
		"#   #",
		"# # #",
		"#   #",
		" ### ",
		"     ",
	},
	["\2"] = {
		"     ",
		"     ",
		" ### ",
		"#####",
		"# # #",
		"#####",
		"#   #",
		"## ##",
		" ### ",
		"     ",
  	},
	["\3"] = {
		"     ",
		"     ",
		" # # ",
		"#####",
		"#####",
		"#####",
		"#####",
		" ### ",
		"  #  ",
		"     ",
  	},
	["\4"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"  #  ",
		" ### ",
		"#####",
		" ### ",
		"  #  ",
		"     ",
  	},
	["\5"] = {
		"     ",
		"     ",
		"  #  ",
		" ### ",
		"  #  ",
		"#####",
		"#####",
		"  #  ",
		" ### ",
		"     ",
  	},
	["\6"] = {
		"     ",
		"     ",
		"     ",
		"  #  ",
		" ### ",
		"#####",
		"#####",
		"  #  ",
		" ### ",
		"     ",
  	},
	["•"] = {
		"    ",
		"    ",
		"    ",
		" ## ",
		"####",
		"####",
		" ## ",
		"    ",
		"    ",
		"    ",
	},
	["↕"] = {
		"     ",
		"     ",
		"  #  ",
		" ### ",
		"#####",
		"  #  ",
		"  #  ",
		"#####",
		" ### ",
		"  #  ",
	},
	["╜"] = {
		"     ",
		"     ",
		"#   #",
		"#  # ",
		"   # ",
		"  #  ",
		" #  #",
		" # # ",
		"#  ##",
		"     ",
	},
	-- ["╜"] = {
	-- 	"     ",
	-- 	"  #  ",
	-- 	"  #  ",
	-- 	" ### ",
	-- 	"     ",
	-- 	"#####",
	-- 	"     ",
	-- 	" ### ",
	-- 	"   # ",
	-- 	" ####",
	-- },
	["→"] = {
		"     ",
		"     ",
		"     ",
		"  #  ",
		"  ## ",
		"#####",
		"  ## ",
		"  #  ",
		"     ",
		"     ",
	},
	["►"] = {
		"     ",
		"     ",
		"     ",
		"#    ",
		"###  ",
		"#####",
		"###  ",
		"#    ",
		"     ",
		"     ",
	},
	["\8"] = {
		"    ",
		"    ",
		"####",
		"#  #",
		"    ",
		"    ",
		"#  #",
		"####",
		"####",
		"    ",
	},
	["←"] = {
		"     ",
		"     ",
		"     ",
		"  #  ",
		" ##  ",
		"#####",
		" ##  ",
		"  #  ",
		"     ",
		"     ",
	},
	["�"] = {
		"     ",
		"     ",
		"     ",
		"#   #",
		" ### ",
		"#   #",
		"#   #",
		" ### ",
		"#   #",
		"     ",
	},

	[" "] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     "
	},
	["!"] = {
		" ",
		" ",
		"#",
		"#",
		"#",
		"#",
		"#",
		" ",
		"#",
		" ",
},
	["."] = {
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		"#",
		" ",
},
	[","] = {
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		" ",
		"#",
		"#",
},
	["-"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"     ",
		"     ",
		"     ",
		"     ",
},
	["?"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"    #",
		"   # ",
		"  #  ",
		"     ",
		"  #  ",
		"     ",
},
	[":"] = {
		" ",
		" ",
		" ",
		"#",
		" ",
		" ",
		" ",
		" ",
		"#",
		" ",
},
	[";"] = {
		" ",
		" ",
		" ",
		"#",
		" ",
		" ",
		" ",
		" ",
		"#",
		"#",
},
	["'"] = {
		"  ",
		"  ",
		" #",
		" #",
		"# ",
		"  ",
		"  ",
		"  ",
		"  ",
		"  ",
},

	["%"] = {
		"     ",
		"     ",
		"#   #",
		"#  # ",
		"   # ",
		"  #  ",
		" #   ",
		" #  #",
		"#   #",
		"     ",
	},

	["{"] = {
		"    ",
		"    ",
		"  ##",
		" #  ",
		" #  ",
		"#   ",
		" #  ",
		" #  ",
		"  ##",
		"    ",
	},

	["}"] = {
		"    ",
		"    ",
		"##  ",
		"  # ",
		"  # ",
		"   #",
		"  # ",
		"  # ",
		"##  ",
		"    ",
	},

	["/"] = {
		"     ",
		"     ",
		"    #",
		"   # ",
		"   # ",
		"  #  ",
		" #   ",
		" #   ",
		"#    ",
		"     ",
	},

	["\\"] = {
		"     ",
		"     ",
		"#    ",
		" #   ",
		" #   ",
		"  #  ",
		"   # ",
		"   # ",
		"    #",
		"     ",
	},

	["|"] = {
		" ",
		" ",
		"#",
		"#",
		"#",
		"#",
		"#",
		"#",
		"#",
		" ",
	},

	['"'] = {
		"   ",
		"   ",
		"# #",
		"# #",
		"   ",
		"   ",
		"   ",
		"   ",
		"   ",
		"   ",
	},

	['#'] = {
		"     ",
		"     ",
		" # # ",
		" # # ",
		"#####",
		" # # ",
		"#####",
		" # # ",
		" # # ",
		"     ",
	},

	['$'] = {
		"     ",
		"     ",
		"  #  ",
		" ####",
		"#    ",
		" ### ",
		"    #",
		"#### ",
		"  #  ",
		"     ",
	},

	['&'] = {
		"     ",
		"     ",
		"  #  ",
		" # # ",
		"  #  ",
		" ## #",
		"# ## ",
		"#  # ",
		" ## #",
		"     ",
	},

	['`'] = {
		"  ",
		"  ",
		"# ",
		"# ",
		" #",
		"  ",
		"  ",
		"  ",
		"  ",
		"  ",
	},

	['*'] = {
		"    ",
		"    ",
		"#  #",
		" ## ",
		"#  #",
		"    ",
		"    ",
		"    ",
		"    ",
		"    ",
	},

	['('] = {
		"     ",
		"     ",
		"   ##",
		"  #  ",
		" #   ",
		" #   ",
		" #   ",
		"  #  ",
		"   ##",
		"     ",
	},

	[')'] = {
		"     ",
		"     ",
		"##  ",
		"  # ",
		"   #",
		"   #",
		"   #",
		"  # ",
		"##  ",
		"     ",
	},

	['+'] = {
		"     ",
		"     ",
		"     ",
		"  #  ",
		"  #  ",
		"#####",
		"  #  ",
		"  #  ",
		"     ",
		"     ",
	},

	['<'] = {
		"    ",
		"    ",
		"   #",
		"  # ",
		" #  ",
		"#   ",
		" #  ",
		"  # ",
		"   #",
		"    ",
	},

	['>'] = {
		"    ",
		"    ",
		"#   ",
		" #  ",
		"  # ",
		"   #",
		"  # ",
		" #  ",
		"#   ",
		"    ",
	},

	['~'] = {
		"      ",
		"      ",
		" ##  #",
		"#  ## ",
		"      ",
		"      ",
		"      ",
		"      ",
		"      ",
		"      ",
	},

	['^'] = {
		"     ",
		"     ",
		"  #  ",
		" # # ",
		"#   #",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
	},

	[']'] = {
		"   ",
		"   ",
		"###",
		"#  ",
		"#  ",
		"#  ",
		"#  ",
		"#  ",
		"###",
		"   ",
	},

	['['] = {
		"   ",
		"   ",
		"###",
		"  #",
		"  #",
		"  #",
		"  #",
		"  #",
		"###",
		"   ",
	},

	['_'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"     ",
	},

	['@'] = {
		"      ",
		"      ",
		" #### ",
		"#    #",
		"# ## #",
		"# ## #",
		"# ####",
		"#     ",
		" #### ",
		"      ",
	},

	['='] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"     ",
		"#####",
		"     ",
		"     ",
		"     ",
	},

	[''] = {
		"     ",
		"     ",
		" #  #",
		"#  # ",
		"  #  ",
		" #  #",
		"#  # ",
		"  #  ",
		" #  #",
		"     ",
	},

	["0"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#  ##",
		"# # #",
		"##  #",
		"#   #",
		" ### ",
		"     ",
},
	["1"] = {
		"     ",
		"     ",
		"  #  ",
		" ##  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"#####",
		"     ",
},
["2"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"    #",
		"  ## ",
		" #   ",
		"#    ",
		"#####",
		"     ",
},
	["3"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"    #",
		"  ## ",
		"    #",
		"#   #",
		" ### ",
		"     ",
},
	["4"] = {
		"     ",
		"     ",
		"   ##",
		"  # #",
		" #  #",
		"#   #",
		"#####",
		"    #",
		"    #",
		"     ",
},
	["5"] = {
		"     ",
		"     ",
		"#####",
		"#    ",
		"#### ",
		"    #",
		"    #",
		"#   #",
		" ### ",
		"     ",
},
	["6"] = {
		"     ",
		"     ",
		"  ## ",
		" #   ",
		"#    ",
		"#### ",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
	["7"] = {
		"     ",
		"     ",
		"#####",
		"#   #",
		"    #",
		"   # ",
		"  #  ",
		"  #  ",
		"  #  ",
		"     ",
},
	["8"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		" ### ",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
	["9"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"   # ",
		" ##  ",
		"     ",
},

	["A"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"     ",
		},
	["B"] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"     ",
	},
	["C"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		"#    ",
		"#    ",
		"#   #",
		" ### ",
		"     ",
	},
	["D"] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#### ",
		"     ",
	},
	["E"] = {
		"     ",
		"     ",
		"#####",
		"#    ",
		"#    ",
		"#### ",
		"#    ",
		"#    ",
		"#####",
		"     ",
},
	["F"] = {
		"     ",
		"     ",
		"#####",
		"#    ",
		"#    ",
		"#### ",
		"#    ",
		"#    ",
		"#    ",
		"     ",
	},
	["G"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		"#  ##",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
	["H"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"     ",
},
	["I"] = {
		"     ",
		"     ",
		"#####",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"#####",
		"     ",
},
	["J"] = {
		"     ",
		"     ",
		"    #",
		"    #",
		"    #",
		"    #",
		"    #",
		"#   #",
		" ### ",
		"     ",
},
	["K"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#  # ",
		"###  ",
		"#  # ",
		"#   #",
		"#   #",
		"     ",
},
	["L"] = {
		"     ",
		"     ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#####",
		"     ",
},
	["M"] = {
		"     ",
		"     ",
		"#   #",
		"## ##",
		"# # #",
		"# # #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
},
	["N"] = {
		"     ",
		"     ",
		"#   #",
		"##  #",
		"##  #",
		"# # #",
		"#  ##",
		"#  ##",
		"#   #",
		"     ",
},
	["O"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
["P"] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"#    ",
		"#    ",
		"#    ",
		"     ",
},
	["Q"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#  # ",
		" ## #",
		"     ",
},
	["R"] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"#   #",
		"#   #",
		"#   #",
		"     ",
},
	["S"] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		" ### ",
		"    #",
		"#   #",
		" ### ",
		"     ",
},
	["T"] = {
		"     ",
		"     ",
		"#####",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"     ",
},
	["U"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
	["V"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		" # # ",
		" # # ",
		"  #  ",
		"     ",
},
["W"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"# # #",
		"## ##",
		"#   #",
		"     ",
},
	["X"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		" # # ",
		"  #  ",
		" # # ",
		"#   #",
		"#   #",
		"     ",
},
	["Y"] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		" # # ",
		"  #  ",
		"  #  ",
		"  #  ",
		"     ",
},
["Z"] = {
		"     ",
		"     ",
		"#####",
		"    #",
		"   # ",
		"  #  ",
		" #   ",
		"#    ",
		"#####",
		"     ",
},

	["a"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"    #",
		" ####",
		"#   #",
		" ####",
		"     ",
},
	["b"] = {
		"     ",
		"     ",
		"#    ",
		"#    ",
		"# ## ",
		"##  #",
		"#   #",
		"#   #",
		"#### ",
		"     ",
},
	["c"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		"#   #",
		" ### ",
		"     ",
},
	["d"] = {
		"     ",
		"     ",
		"    #",
		"    #",
		"    #",
		" ## #",
		"#  ##",
		"#   #",
		" ####",
		"     ",
},
	["e"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#####",
		"#    ",
		" ####",
		"     ",
},
	["f"] = {
		"    ",
		"    ",
		"  ##",
		" #  ",
		"####",
		" #  ",
		" #  ",
		" #  ",
		" #  ",
		"    ",
},
	["g"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ####",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"#### ",
},
	["h"] = {
		"     ",
		"     ",
		"#    ",
		"#    ",
		"# ## ",
		"##  #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
},
	["i"] = {
		" ",
		" ",
		"#",
		" ",
		"#",
		"#",
		"#",
		"#",
		"#",
		" ",
},
	["j"] = {
		"     ",
		"     ",
		"    #",
		"     ",
		"    #",
		"    #",
		"    #",
		"#   #",
		"#   #",
		" ### ",
},
	["k"] = {
		"    ",
		"    ",
		"#   ",
		"#   ",
		"#  #",
		"# # ",
		"##  ",
		"# # ",
		"#  #",
		"    ",
},
	["l"] = {
		"  ",
		"  ",
		"# ",
		"# ",
		"# ",
		"# ",
		"# ",
		"# ",
		" #",
		"  ",
},
	["m"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"## # ",
		"# # #",
		"# # #",
		"#   #",
		"#   #",
		"     ",
},
	["n"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
},
	["o"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#   #",
		" ### ",
		"     ",
},
	["p"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"# ## ",
		"##  #",
		"#   #",
		"#### ",
		"#    ",
		"#    ",
},
	["q"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ## #",
		"#  ##",
		"#   #",
		" ####",
		"    #",
		"    #",
},
	["r"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"# ## ",
		"##  #",
		"#    ",
		"#    ",
		"#    ",
		"     ",
},
	["s"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ####",
		"#    ",
		" ### ",
		"    #",
		"#### ",
		"     ",
},
	["t"] = {
		"   ",
		"   ",
		" # ",
		" # ",
		"###",
		" # ",
		" # ",
		" # ",
		"  #",
		"   ",
},
	["u"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		" ####",
		"     ",
},
	["v"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		" # # ",
		"  #  ",
		"     ",
},
	["w"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		"# # #",
		"# # #",
		" ####",
		"     ",
},
	["x"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		" # # ",
		"  #  ",
		" # # ",
		"#   #",
		"     ",
},
	["y"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"#### ",
},
	["z"] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"   # ",
		"  #  ",
		" #   ",
		"#####",
		"     ",
},
	['А'] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['Б'] = {
		"     ",
		"     ",
		"#### ",
		"#    ",
		"#    ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"     ",
	},
	['В'] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"     ",
	},
	['Г'] = {
		"     ",
		"     ",
		"#####",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"     ",
	},
	['Ґ'] = {
		"     ",
		"    #",
		"#####",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"     "
	},
	['Д'] = {
		"     ",
		"     ",
		" ####",
		" #  #",
		" #  #",
		" #  #",
		" #  #",
		" #  #",
		"######",
		"#    #",
	},
	['Е'] = {
		"     ",
		"     ",
		"#####",
		"#    ",
		"#    ",
		"#### ",
		"#    ",
		"#    ",
		"#####",
		"     ",
	},
	['Є'] = {
		"     ",
		"     ",
		" ####",
		"#    ",
		"#    ",
		"#### ",
		"#    ",
		"#    ",
		" ####",
		"     ",
	},
	['Ё'] = {
		" # # ",
		"     ",
		"#####",
		"#    ",
		"#    ",
		"#### ",
		"#    ",
		"#    ",
		"#####",
		"     ",
	},
	['Ж'] = {
		"     ",
		"     ",
		"# # #",
		"# # #",
		" ### ",
		"# # #",
		"# # #",
		"# # #",
		"# # #",
		"     ",
	},
	['З'] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"    #",
		"   # ",
		"    #",
		"#   #",
		" ### ",
		"     ",
	},
	['І'] = {
		"   ",
		"   ",
		"###",
		" # ",
		" # ",
		" # ",
		" # ",
		" # ",
		"###",
		"   ",
	},
	['Ї'] = {
		"# #",
		"   ",
		"###",
		" # ",
		" # ",
		" # ",
		" # ",
		" # ",
		"###",
		"   ",
	},
	['И'] = {
		"     ",
		"     ",
		"#   #",
		"#  ##",
		"#  ##",
		"# # #",
		"##  #",
		"##  #",
		"#   #",
		"     ",
	},
	['Й'] = {
		" # # ",
		"  #  ",
		"#   #",
		"#  ##",
		"#  ##",
		"# # #",
		"##  #",
		"##  #",
		"#   #",
		"     ",
	},
	['К'] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#  # ",
		"###  ",
		"#  # ",
		"#   #",
		"#   #",
		"     ",
	},
	['Л'] = {
		"     ",
		"     ",
		"  ###",
		" #  #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['М'] = {
		"     ",
		"     ",
		"#   #",
		"## ##",
		"# # #",
		"# # #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['Н'] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['О'] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		" ### ",
		"     ",
	},
	['П'] = {
		"     ",
		"     ",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['Р'] = {
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"#    ",
		"#    ",
		"#    ",
		"     ",
	},
	['С'] = {
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		"#    ",
		"#    ",
		"#   #",
		" ### ",
		"     ",
	},
	['Т'] = {
		"     ",
		"     ",
		"#####",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"     ",
	},
	['У'] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"#   #",
		" ### ",
		"     ",
	},
	['Ф'] = {
		"     ",
		"     ",
		" ### ",
		"# # #",
		"# # #",
		"# # #",
		" ### ",
		"  #  ",
		"  #  ",
		"     ",
	},
	['Х'] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		" # # ",
		"  #  ",
		" # # ",
		"#   #",
		"#   #",
		"     ",
	},
	['Ц'] = {
		"      ",
		"      ",
		"#   # ",
		"#   # ",
		"#   # ",
		"#   # ",
		"#   # ",
		"#   # ",
		"######",
		"     #",
	},
	['Ч'] = {
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"    #",
		"    #",
		"     ",
	},
	['Ш'] = {
		"     ",
		"     ",
		"#   #",
		"# # #",
		"# # #",
		"# # #",
		"# # #",
		"# # #",
		"#####",
		"     ",
	},
	['Щ'] = {
		"      ",
		"      ",
		"#   # ",
		"# # # ",
		"# # # ",
		"# # # ",
		"# # # ",
		"# # # ",
		"######",
		"     #",
	},
	['Ъ'] = {
		"      ",
		"      ",
		"##    ",
		" #    ",
		" #    ",
		" #### ",
		" #   #",
		" #   #",
		" #### ",
		"      ",
	},
	['Ы'] = {
		"     ",
		"     ",
		"#    #",
		"#    #",
		"#    #",
		"###  #",
		"#  # #",
		"#  # #",
		"###  #",
		"     ",
	},
	['Ь'] = {
		"     ",
		"     ",
		"#    ",
		"#    ",
		"#    ",
		"#### ",
		"#   #",
		"#   #",
		"#### ",
		"     ",
	},
	['Э'] = {
		"     ",
		"     ",
		"#### ",
		"    #",
		"    #",
		" ####",
		"    #",
		"    #",
		"#### ",
		"     ",
	},
	['Ю'] = {
		"      ",
		"      ",
		"#  ## ",
		"# #  #",
		"# #  #",
		"###  #",
		"# #  #",
		"# #  #",
		"#  ## ",
		"      ",
	},
		['Я'] = {
		"     ",
		"     ",
		" ####",
		"#   #",
		"#   #",
		" ####",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
	['а'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"    #",
		" ####",
		"#   #",
		" ####",
		"     "
	},
	['б'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#    ",
		"#### ",
		"#   #",
		"#### ",
		"     ",
	},
	['в'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#### ",
		"#   #",
		"#### ",
		"     ",
	},
	['г'] = {
		"    ",
		"    ",
		"    ",
		"    ",
		"####",
		"#   ",
		"#   ",
		"#   ",
		"#   ",
		"    ",
	},
	['ґ'] = {
		"     ",
		"     ",
		"     ",
		"    #",
		"#####",
		"#    ",
		"#    ",
		"#    ",
		"#    ",
		"     "
	},
	['д'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"  ## ",
		" # # ",
		" # # ",
		" # # ",
		"#####",
		"#   #",
	},
	['е'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#####",
		"#    ",
		" ####",
		"     ",
	},
	['є'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ####",
		"#    ",
		"#### ",
		"#    ",
		" ####",
		"     ",
	},
	['ё'] = {
		"     ",
		"     ",
		" # # ",
		"     ",
		" ### ",
		"#   #",
		"#####",
		"#    ",
		" ####",
		"     ",
	},
		['ж'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"# # #",
		"# # #",
		" ### ",
		"# # #",
		"# # #",
		"     ",
	},
		['з'] = {
		"    ",
		"    ",
		"    ",
		"    ",
		"### ",
		"   #",
		" ## ",
		"   #",
		"### ",
		"    ",
	},
		['і'] = {
		"   ",
		"   ",
		" # ",
		"   ",
		" # ",
		" # ",
		" # ",
		" # ",
		" # ",
		"   ",
	},
		['ї'] = {
		"   ",
		"   ",
		"# #",
		"   ",
		" # ",
		" # ",
		" # ",
		" # ",
		" # ",
		"   ",
	},
		['и'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#  ##",
		"# # #",
		"##  #",
		"#   #",
		"     ",
	},
		['й'] = {
		"     ",
		"     ",
		" # # ",
		"  #  ",
		"#   #",
		"#  ##",
		"# # #",
		"##  #",
		"#   #",
		"     ",
	},
		['к'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#  # ",
		"###  ",
		"#  # ",
		"#   #",
		"     ",
	},
		['л'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"  ###",
		" #  #",
		" #  #",
		" #  #",
		"#   #",
		"     ",
	},
	['м'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"## ##",
		"# # #",
		"#   #",
		"#   #",
		"     ",
	},
		['н'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		"#####",
		"#   #",
		"#   #",
		"     ",
	},
		['о'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#   #",
		"#   #",
		" ### ",
		"     ",
	},
		['п'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"#   #",
		"#   #",
		"#   #",
		"#   #",
		"     ",
	},
		['р'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#### ",
		"#   #",
		"#### ",
		"#    ",
		"#    ",
		"     ",
	},
		['с'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"#   #",
		"#    ",
		"#   #",
		" ### ",
		"     ",
	},
		['т'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#####",
		"  #  ",
		"  #  ",
		"  #  ",
		"  #  ",
		"     ",
	},
		['у'] = {
		"    ",
		"    ",
		"    ",
		"    ",
		"#   #",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"#### ",
	},
		['ф'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ### ",
		"# # #",
		"# # #",
		"# # #",
		" ### ",
		"  #  ",
	},
		['х'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		" # # ",
		"  #  ",
		" # # ",
		"#   #",
		"     ",
	},
		['ц'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   # ",
		"#   # ",
		"#   # ",
		"#   # ",
		" #####",
		"     #",
	},
		['ч'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"#   #",
		" ####",
		"    #",
		"    #",
		"     ",
	},
		['ш'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#   #",
		"# # #",
		"# # #",
		"# # #",
		"#####",
		"     ",
	},
		['щ'] = {
		"      ",
		"      ",
		"      ",
		"      ",
		"#   # ",
		"# # # ",
		"# # # ",
		"# # # ",
		"######",
		"     #",
	},
		['ъ'] = {
		"      ",
		"      ",
		"      ",
		"      ",
		"##    ",
		" #    ",
		" #### ",
		" #   #",
		" #### ",
		"      ",
	},
		['ы'] = {
		"      ",
		"      ",
		"      ",
		"      ",
		"#    #",
		"#    #",
		"###  #",
		"#  # #",
		"###  #",
		"      ",
	},
		['ь'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#    ",
		"#    ",
		"#### ",
		"#   #",
		"#### ",
		"     ",
	},
	['э'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#### ",
		"    #",
		" ####",
		"    #",
		"#### ",
		"     ",
	},
		['ю'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		"#  # ",
		"# # #",
		"### #",
		"# # #",
		"#  # ",
		"     ",
	},
		['я'] = {
		"     ",
		"     ",
		"     ",
		"     ",
		" ####",
		"#   #",
		" ####",
		"#   #",
		"#   #",
		"     ",
	},
}

Font.charWidth = 6
Font.charHeight = 10
Font.interval = 1

local UPPER_MAP = {
	["а"]="А", ["б"]="Б", ["в"]="В", ["г"]="Г", ["д"]="Д",
	["е"]="Е", ["ё"]="Ё", ["є"]="Є", ["ж"]="Ж", ["з"]="З",
	["и"]="И", ["і"]="І", ["ї"]="Ї", ["й"]="Й", ["к"]="К",
	["л"]="Л", ["м"]="М", ["н"]="Н", ["о"]="О", ["п"]="П",
	["р"]="Р", ["с"]="С", ["т"]="Т", ["у"]="У", ["ф"]="Ф",
	["х"]="Х", ["ц"]="Ц", ["ч"]="Ч", ["ш"]="Ш", ["щ"]="Щ",
	["ъ"]="Ъ", ["ы"]="Ы", ["ь"]="Ь", ["э"]="Э", ["ю"]="Ю", ["я"]="Я",
}

local LOWER_MAP = {}
for k, v in pairs(UPPER_MAP) do
	LOWER_MAP[v] = k
end

local function utf8_iter(str)
	return str:gmatch("[%z\1-\127\194-\244][\128-\191]*")
end

function Font.upper(str)
	local result = {}

	for ch in utf8_iter(str) do
		if UPPER_MAP[ch] then
			table.insert(result, UPPER_MAP[ch])
		else
			table.insert(result, string.upper(ch))
		end
	end

	return table.concat(result)
end

function Font.lower(str)
	local result = {}

	for ch in utf8_iter(str) do
		if LOWER_MAP[ch] then
			table.insert(result, LOWER_MAP[ch])
		else
			table.insert(result, string.lower(ch))
		end
	end

	return table.concat(result)
end

local function isInside(fx, fy, x, y, w, h)
	return
	(fx >= x and
	fx <= x + w and
	fy >= y and
	fy <= y + h)
end

local function isInsideRect(dx, dy, radius)
	local c = radius - 0.5
	return (dx - c)^2 + (dy - c)^2 <= radius * radius + 0.01
end

-- Допоміжна функція: чи знаходиться точка (x, y) всередині кола?
local function isInsideCirle(x, y, cx, cy, radius)
	local dx = x - cx
	local dy = y - cy
	-- Використовуємо формулу кола x^2 + y^2 <= R^2 (без math.sqrt для швидкодії)
	-- Додаємо мізерну похибку (0.01), щоб нівелювати проблеми з плаваючою комою
	return (dx * dx + dy * dy) <= (radius * radius + 0.01)
end

-- local function isInsideRoundedRect(fx, fy, x, y, w, h, r)
-- 	if not -- inside default rect
-- 	(fx >= x and
-- 	fx <= x + w and
-- 	fy >= y and
-- 	fy <= y + h)
-- 	then return false end

-- 	-- inside without circles
-- 	if fx >= x + r and fx < x + w - r then return true end
--     if fy >= y + r and fy < y + h - r then return true end

-- 	-- rounded corners
-- 	if isInsideCirle(fx, fy, x + r, y + r, r) then return true end
-- 	if isInsideCirle(fx, fy, x + r, y + h - r, r) then return true end
-- 	if isInsideCirle(fx, fy, x + w - r, y + r, r) then return true end
-- 	if isInsideCirle(fx, fy, x + w - r, y + h - r, r) then return true end

-- 	return false
-- end

local function isInsideRoundedRect(fx, fy, x, y, w, h, r)
    if not (fx and fy and x and y and w and h) then return false end

    local R = math.floor(r or 0)
    R = math.min(R, math.floor(w / 2), math.floor(h / 2))

    if fx < x or fx > x + w - 1 or fy < y or fy > y + h - 1 then
        return false
    end

    if fy >= y + R and fy <= y + h - R - 1 then
        return true
    end

    local j
    if fy < y + R then
        j = fy - y
    else
        j = (y + h - 1) - fy
    end

    local offset = R
    for i = 0, R - 1 do
        if isInsideRect(i, j, R) then
            offset = i
            break
        end
    end

    return fx >= x + offset and fx <= x + w - 1 - offset
end

local function checkInside(fx, fy, x, y, w, h, radius)
	if not (fx and fy and x and y and w and h) then return true end
	if radius then return isInsideRoundedRect(fx, fy, x, y, w, h, radius) end
	return isInside(fx, fy, x, y, w, h)
end

local function checkGM()
	if not term.getGraphicsMode() then
		error("Need to enable graphics mode first: term.setGraphicsMode(1) or (2)", 2)
	end
end

local function getGlyph(ch)
	return Font.glyphs[ch] or Font.glyphs["?"]
end

local function getChar(s, i)
	local offset = utf8.offset(s, i)
	if not offset then return nil end
	local nextOffset = utf8.offset(s, i + 1) or (#s + 1)
	return s:sub(offset, nextOffset - 1)   -- тепер це повний символ!
end

function Font.calcWidth(text, isbold, scale)
	checkGM()
	if not scale then
		scale = 1
	else
		scale = math.max(1, math.min(10, scale))
	end
	if not utf8.len(text) then error('Invalid character in: \'' .. text .. '\'', 2) end
	local px = 0
	for i = 1, utf8.len(text) do
		local ch = getChar(text, i)
		local glyph = getGlyph(ch)
		local len = 0
		for row = 1, Font.charHeight do
			local line = glyph[row]
			len = math.max(#line, len)
		end

		px = px + math.ceil(scale * math.min(Font.charWidth, len) + Font.interval * scale) + (isbold == true and 1 or type(isbold) == 'number' and isbold or 0)
	end
	px = px - Font.interval * scale
	return px
end

local function drawPx(pixel, scale, sx, sy, fc, bc)
	scale = math.ceil(scale)
	if pixel == "#" then
		for dy = 0, scale - 1 do
			for dx = 0, scale - 1 do
				term.setPixel(sx + dx, sy + dy, fc)
				if bold then term.setPixel(sx + scale, sy, fc) end
			end
		end
	elseif bc and pixel == " " then
		for dy = 0, scale - 1 do
			for dx = 0, scale - 1 do
				term.setPixel(sx + dx, sy + dy, bc)
			end
		end
	end
end

local function drawUnderline(fromX, toX, y, fc, scale, inside_x, inside_y, inside_w, inside_h, radius)
	local sy = y + Font.charHeight * scale - 1
	for x = fromX, toX do
		for s = 0, scale - 1 do
			local line_y = sy + s
			if checkInside(x, line_y, inside_x, inside_y, inside_w, inside_h, radius) then term.setPixel(x, line_y, fc) end
		end
	end
end

---@alias color number

---comment
---@param text string
---@param x number
---@param y number
---@param fc color
---@param w? number
---@param h? number
---@param bc? color
---@param align? string
---@param underline? boolean
---@param bold? boolean
---@param scale? number
---@param inside_x? number
---@param inside_y? number
---@param inside_w? number
---@param inside_h? number
---@param radius? number
function Font.drawText(text, x, y, fc, w, h, bc, align, underline, bold, scale, inside_x, inside_y, inside_w, inside_h, radius)
	checkGM()
	if not scale then
		scale = 1
	else
		scale = math.max(1, math.min(10, scale))
	end
	if not utf8.len(text) then error('Invalid character in: \'' .. text .. '\'', 2) end
	if align and w and h then
		local textWidth = Font.calcWidth(text, bold, scale)
		local dx = w - textWidth
		local dy = h - Font.charHeight * scale
		-- align
		local X, Y = x, y
		x = X + math.floor(dx / 2)
		y = Y + math.floor(dy / 2)
		if align:find('left', 1, true) then
			x = X
		elseif align:find('right', 1, true) then
			x = X + dx
		end
		if align:find('top', 1, true) then
			y = Y
		elseif align:find('bot', 1, true) then
			y = Y + dy
		end
	end

	local px = x
	for i = 1, utf8.len(text) do
		local ch = getChar(text, i)
		local glyph = getGlyph(ch)
		local len = 0
		for row = 1, Font.charHeight do
			local line = glyph[row]
			if not line then return error('Invalid bitmap of ' .. ch) end
			len = math.max(#line, len)
			for col = 1, Font.charWidth do
				local pixel = line:sub(col, col)
				local sx, sy = px + (col - 1) * scale, y + (row - 2) * scale
				if checkInside(sx, sy, inside_x, inside_y, inside_w, inside_h, radius) then
					drawPx(pixel, scale, sx, sy, fc, bc)
				end
			end
		end
		px = px + math.ceil(scale * math.min(Font.charWidth, len) + Font.interval * scale) + (bold == true and 1 or type(isbold) == 'number' and isbold or 0)
	end
	if underline then
		drawUnderline(x, px - Font.interval, y, fc, scale, inside_x, inside_y, inside_w, inside_h)
	end
end

---comment
---@param text string
---@param x number
---@param y number
---@param fc color
---@param w number
---@param h number
---@param align string
function Font.simpleText(text, x, y, fc, w, h, align)
	return Font.drawText(text, x, y, fc, w, h, nil, align)
end

function Font.underlinedAlignedText(text, x, y, fc, w, h, align)
	return Font.drawText(text, x, y, fc, w, h, nil, align, true)
end

function Font.boldAlignedText(text, x, y, fc, w, h, align)
	return Font.drawText(text, x, y, fc, w, h, nil, align, false, true)
end

function Font.underlinedBoldAlignedText(text, x, y, fc, w, h, align)
	return Font.drawText(text, x, y, fc, w, h, nil, align, true, true)
end

function Font.write(text)
	local x, y = term.getCursorPos()
	return Font.drawText(text, x, y, term.getTextColor())
end

function Font.aText(a)
	if not a or not a.text then return end
	return Font.drawText(
	a.text, a.x, a.y, a.fc,
	a.w, a.h, a.bc, a.align,
	a.underline, a.bold, a.scale,
	a.inside_x or a.ix,
	a.inside_y or a.iy,
	a.inside_w or a.iw,
	a.inside_h or a.ih
)
end

return Font